v2206/multiphase_solverComparisons/angledDuct/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    bottom
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    left
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    right
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}

// internalField   uniform 200;

// boundaryField
// {
//     "(front|back|walls|porosityWall)"
//     {
//         type            epsilonWallFunction;
//         value           uniform 200;
//     }

//     inlet
//     {
//         type            turbulentMixingLengthDissipationRateInlet;
//         mixingLength    0.005;
//         value           uniform 200;
//     }

//     outlet
//     {
//         type            inletOutlet;
//         inletValue      uniform 200;
//         value           uniform 200;
//     }
// }


// ************************************************************************* //
