v2206/multiphase_solverComparisons/angledDuct/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    top
    {
        type            calculated;
        value           $internalField;
    }

    left
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    right
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}

// internalField   uniform 0;

// boundaryField
// {
//     "(front|back|walls|porosityWall)"
//     {
//         type            nutkWallFunction;
//         value           uniform 0;
//     }

//     "(inlet|outlet)"
//     {
//         type            calculated;
//         value           uniform 0;
//     }
// }


// ************************************************************************* //
