v2206/multiphase_solverComparisons/angledDuct/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    // volScalarFieldValue alpha.air      1.00
    volScalarFieldValue alpha.water    0.00
    volScalarFieldValue s              0.00
);

regions
(
    boxToCell
    {
        box (0 0 0) (1 0.12 1);
        fieldValues
        (
            // volScalarFieldValue alpha.air       0.00
            volScalarFieldValue alpha.water     1.00
            volScalarFieldValue s               1.65
        );
    }

    // sphereToCell
    // {
    //     centre (0.02 0.02 0.0001);
    //     radius 0.003;
    //     fieldValues
    //     (
    //         volScalarFieldValue alpha.liquid    0
    //         volScalarFieldValue alpha.air       1
    //     );
    // }

    // sphereToCell
    // {
    //     centre (0.02 0.02 0.0001);
    //     radius 0.003;
    //     fieldValues
    //     (
    //         volScalarFieldValue brine           1.65
    //     );
    // }
);


// ************************************************************************* //
